Repository: Hewialex/new_flutter_project
Catalog: lib/l10n/intl_*.arb
Languages: am

source: Home
am: ቤት

source: My Profile
am: የእኔ መገለጫ

source: Profile Visits
am: የመገለጫ ጉብኝቶች

source: Favorite list
am: የተወደዱ ዝርዝር

source: Who Favorited me?
am: ማን አደንቆኛል?

source: Ignore list
am: የማስወገጃ ዝርዝር

source: Photo Studio
am: ፎቶ ስቱዲዮ

source: Contact Us
am: አግኙን

source: About Us
am: ስለ እኛ

source: Share App
am: መተግበሪያውን አጋራ

source: Settings
am: ቅንብሮች

source: Account Information
am: የመለያ መረጃ

source: Profile Settings
am: የመገለጫ ቅንብሮች

source: Sign Out
am: ውጣ

# confirmationTitle
source: Confirmation
am: ማረጋገጫ

# signOutConfirmation
source: Are you sure you want to Sign out?
am: እርግጠኛ ነዎት መውጣት ይፈልጋሉ?

source: Yes
am: አዎን

source: No
am: አይደለም

# retryButton
source: Retry
am: እንደገና ሞክር

# unableToLoadProfile
source: Unable to load user profile
am: የተጠቃሚውን መገለጫ መጫን አልተቻለም

source: Unimplemented state
am: ያልተተገበረ ሁኔታ

# emailRequired
source: Please enter your email
am: እባክዎ ኢሜይልዎን ያስገቡ

# invalidEmail
source: Please enter a valid email address
am: እባክዎ ትክክለኛ የኢሜይል አድራሻ ያስገቡ

# confirmPasswordRequired
source: Please confirm your password
am: እባክዎ የይለፍ ቃልዎን ያረጋግጡ

# passwordRequired
source: Please enter your password
am: እባክዎ የይለፍ ቃል ያስገቡ

source: Passwords do not match
am: የይለፍ ቃሎቹ አይዛመዱም

# enterPassword
source: Please enter your password
am: እባክዎ የይለፍ ቃል ያስገቡ

# locationServicesDisabled
source: Location services are disabled.
am: የአካባቢ አገልግሎቶች ተሰናክለዋል።

# locationPermissionsDenied
source: Location permissions are denied
am: የአካባቢ ፈቃዶች ተከልክለዋል

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied.
am: የአካባቢ ፈቃዶች በቋሚነት ተከልክለዋል።

# websocketConnectionExists
source: Connection already established. Disconnecting the existing connection.
am: ግንኙነት አስቀድሞ ተመስርቷል። ያለውን ግንኙነት በማቋረጥ ላይ።

# websocketNoConnection
source: No active connection to disconnect.
am: ለማቋረጥ ምንም ንቁ ግንኙነት የለም።

# websocketClosing
source: Closing Websocket connection...
am: የWebsocket ግንኙነት በመዝጋት ላይ...

# websocketClosed
source: Websocket connection closed.
am: የWebsocket ግንኙነት ተዘግቷል።

# websocketError
source: Error processing WebSocket message: {error}
am: የWebSocket መልዕክትን በማስኬድ ላይ ስህተት፦ {error}

# aboutUsTitle
source: About us
am: ስለ እኛ

# aboutUsDescription1
source: lorem ipsum dolor sit amet, consectetur adipiscing elit. Nulla nec purus feugiat, vestibulum nunc sit amet, ultrices nisl. Nulla facilisi. Nulla nec purus feugiat, vestibulum nunc sit amet, ultrices nisl. Nulla facilisi.
am: ይህ ጽሑፍ በተመሳሳይ ቦታ ሊተካ የሚችል የጽሑፍ ናሙና ነው። ይህ ጽሑፍ ከአማርኛ ጽሑፍ ጄኔሬተር ተውልዷል። እንደዚህ ያለ ጽሑፍ ወይም ሌሎች ብዙ ጽሑፎችን ማመንጨት እና መተግበሪያው የሚያመነጭውን የፊደላት ብዛት መጨመር ትችላለህ።

# aboutUsDescription2
source: lorem ipsum dolor sit amet, consectetur adipiscing elit. Nulla nec purus feugiat, vestibulum nunc sit amet, ultrices nisl. Nulla facilisi. Nulla nec purus feugiat, vestibulum nunc sit amet, ultrices nisl. Nulla facilisi.
am: ይህ ጽሑፍ በተመሳሳይ ቦታ ሊተካ የሚችል የጽሑፍ ናሙና ነው። ይህ ጽሑፍ ከአማርኛ ጽሑፍ ጄኔሬተር ተውልዷል። እንደዚህ ያለ ጽሑፍ ወይም ሌሎች ብዙ ጽሑፎችን ማመንጨት እና መተግበሪያው የሚያመነጭውን የፊደላት ብዛት መጨመር ትችላለህ።

# aboutUsDescription3
source: lorem ipsum dolor sit amet, consectetur adipiscing elit. Nulla nec purus feugiat, vestibulum nunc sit amet, ultrices nisl. Nulla facilisi. Nulla nec purus feugiat, vestibulum nunc sit amet, ultrices nisl. Nulla facilisi.
am: ይህ ጽሑፍ በተመሳሳይ ቦታ ሊተካ የሚችል የጽሑፍ ናሙና ነው። ይህ ጽሑፍ ከአማርኛ ጽሑፍ ጄኔሬተር ተውልዷል። እንደዚህ ያለ ጽሑፍ ወይም ሌሎች ብዙ ጽሑፎችን ማመንጨት እና መተግበሪያው የሚያመነጭውን የፊደላት ብዛት መጨመር ትችላለህ።

source: Sign In
am: ግባ

source: Sign Up
am: ተመዝገብ

source: Forgot Password?
am: የይለፍ ቃል ረስተዋል?

source: Reset Password
am: የይለፍ ቃል ዳግም ያስተካክሉ

source: Verify Email
am: ኢሜይል ያረጋግጡ

source: Email
am: ኢሜር

source: Password
am: የይለፍ ቃል

source: Confirm Password
am: የይለፍ ቃል ያረጋግጡ

source: Phone Number
am: ስልክ ቁጥር

source: Full Name
am: ሙሉ ስም

source: Username
am: የተጠቃሚ ስም

source: Continue with Google
am: በGoogle ይቀጥሉ

source: Continue with Apple
am: በApple ይቀጥሉ

source: Continue with Email
am: በኢሜይል ይቀጥሉ

source: Create Account
am: መለያ ፍጠር

# alreadyHaveAccount
source: Already have an account?
am: አስቀድሞ መለያ አለዎት?

# dontHaveAccount
source: Don't have an account?
am: መለያ የለዎትም?

# nameRequired
source: Please enter your name
am: እባክዎ ስምዎን ያስገቡ

# usernameRequired
source: Please enter a username
am: እባክዎ የተጠቃሚ ስም ያስገቡ

# phoneRequired
source: Please enter your phone number
am: እባክዎ ስልክ ቁጥርዎን ያስገቡ

# invalidPhone
source: Please enter a valid phone number
am: እባክዎ ትክክለኛ ስልክ ቁጥር ያስገቡ

# passwordTooShort
source: Password must be at least 8 characters
am: የይለፍ ቃሉ ቢያንስ 8 ቁምፊዎች መሆን አለበት

# passwordRequirements
source: Password must contain letters, numbers, and special characters
am: የይለፍ ቃሉ ፊደሎችን፣ ቁጥሮችን እና ልዩ ምልክቶችን መያዝ አለበት

# registrationSuccess
source: Registration successful
am: ምዝገባው በተሳካ ሁኔታ ተጠናቅቋል

# passwordResetEmailSent
source: Password reset email has been sent
am: የይለፍ ቃል እንደገና የማስጀመሪያ ኢሜይል ተልኳል

# emailVerificationSent
source: Verification email has been sent
am: የማረጋገጫ ኢሜይል ተልኳል

# invalidCredentials
source: Invalid email or password
am: ልክ ያልሆነ ኢሜይል ወይም የይለፍ ቃል

# accountExists
source: An account with this email already exists
am: በዚህ ኢሜይል የተመዘገበ መለያ አለ

# weakPassword
source: Password is too weak
am: የይለፍ ቃሉ ደካማ ነው

# networkError
source: Network connection error. Please try again
am: የአውታረ መረብ ግንኙነት ስህተት። እባክዎ እንደገና ይሞክሩ

# unknownError
source: An unknown error occurred
am: ያልታወቀ ስህተት ተከስቷል

source: Terms and Conditions
am: የአገልግሎት ውሎች

source: Privacy Policy
am: የግላዊነት ፖሊሲ

# agreeToTerms
source: By continuing, you agree to our {terms} and {privacy}
am: በመቀጠል፣ {terms} እና {privacy} ተስማምተዋል

source: Verification Code
am: የማረጋገጫ ኮድ

# enterVerificationCode
source: Enter the verification code sent to your email
am: ወደ ኢሜይልዎ የተላከውን የማረጋገጫ ኮድ ያስገቡ

source: Resend Code
am: ኮዱን እንደገና ላክ

# didntReceiveCode
source: Didn't receive the code?
am: ኮዱን አልተቀበሉም?

source: Verification successful
am: ማረጋገጫው ተሳክቷል

# chatTitle
source: Messages
am: መልእክቶች

# noMessages
source: No messages yet
am: እስካሁን ምንም መልእክቶች የሉም

# typeMessage
source: Type a message...
am: መልእክት ይጻፉ...

source: Send
am: ላክ

source: Reply
am: መልስ

source: Forward
am: አስተላልፍ

source: Copy
am: ቅዳ

source: Delete
am: ሰርዝ

source: Message deleted
am: መልእክቱ ተሰርዟል

source: Message Info
am: የመልእክት መረጃ

source: Attach File
am: ፋይል አያይዝ

source: Camera
am: ካሜራ

source: Gallery
am: ጋለሪ

source: Document
am: ሰነድ

source: Location
am: አካባቢ

source: Contact
am: እውቂያ

source: Online
am: መስመር ላይ

source: Offline
am: መስመር ውጭ

source: typing...
am: በመጻፍ ላይ...

# lastSeen
source: Last seen {time}
am: መጨረሻ የታየው {time}

source: Block User
am: ተጠቃሚውን አግድ

source: Unblock User
am: ተጠቃሚውን ክልከላ አንሳ

source: Report User
am: ተጠቃሚውን ሪፖርት አድርግ

source: Clear Chat
am: ውይይቱን አጽዳ

source: Delete Chat
am: ውይይቱን ሰርዝ

source: Message not sent
am: መልእክቱ አልተላከም

# retryMessage
source: Tap to retry
am: እንደገና ለመሞከር መታ ያድርጉ

# blockedMessage
source: You can't send messages to this user
am: ለዚህ ተጠቃሚ መልእክት መላክ አይችሉም

source: Photo
am: ፎቶ

source: Video
am: ቪዲዮ

# voice
source: Voice Message
am: የድምጽ መልእክት

source: Downloading...
am: በማውረድ ላይ...

# fileTooBig
source: File is too large
am: ፋይሉ በጣም ትልቅ ነው

# contactUsTitle
source: Contact Us
am: አግኙን

# contactUsDescription
source: We'd love to hear from you. Send us a message and we'll respond as soon as possible.
am: ከእርስዎ መስማት እንወዳለን። መልእክት ይላኩልን እና በተቻለ ፍጥነት እንመልሳለን።

# messageLabel
source: Message
am: መልእክት

# messageHint
source: Type your message here...
am: መልእክትዎን እዚህ ይጻፉ...

# sendButton
source: Send Message
am: መልእክት ላክ

# messageSent
source: Message sent successfully
am: መልእክቱ በተሳካ ሁኔታ ተልኳል

# messageFailed
source: Failed to send message
am: መልእክቱን መላክ አልተሳካም

# messageEmpty
source: Please enter your message
am: እባክዎ መልእክትዎን ያስገቡ

source: Near You
am: በአቅራቢያዎ

source: View all
am: ሁሉንም ይመልከቱ

source: Unknown State
am: ያልታወቀ ሁኔታ

source: Premium
am: ፕሪሚየም

# interactWithHappiness
source: Interact With Your
am: ይገናኙ ከእርስዎ

source: Happiness!
am: ደስታ!

source: Search
am: ፈልግ

source: Members
am: አባላት

source: New members
am: አዲስ አባላት

source: Online members
am: በመስመር ላይ ያሉ አባላት

source: Premium members
am: ፕሪሚየም አባላት

source: Auto searcher
am: ራስሰር ፈላጊ

source: Member Profile
am: የአባል መገለጫ

# deleteFromFavorites
source: Delete from favorite list
am: ከተወደዱ ዝርዝር አስወግድ

source: Delete from ignore list
am: ከማስወገጃ ዝርዝር አስወግድ

source: Cancel
am: ሰርዝ

# memberCount
source: {count, plural, =1{1 member} other{{count} members}}
am: {count, plural, =1{1 አባል} other{{count} አባላት}}

source: Edit your profile
am: መገለጫዎን ያስተካክሉ

source: General Tips:
am: አጠቃላይ ምክሮች:

# qismatiTeamWishes
source: Qismati team wishes you success
am: የቂስማቲ ቡድን ስኬትን ይመኝልዎታል

# profileDescription
source: Tell us about yourself and your ideal partner. Please be truthful and objective when describing yourself and the person you're seeking. Leaving this field blank may limit your chance of finding a suitable match, so be sure to provide detailed and accurate information
am: ስለራስዎ እና ስለሚፈልጉት ባልደረባ ይንገሩን። እባክዎ ራስዎን እና እየፈለጉት ያለውን ሰው ሲገልጹ እውነተኛ እና ሚዛናዊ ይሁኑ። ይህንን ቦታ ባዶ ማድረግ ተስማሚ ጥምረት የማግኘት እድልዎን ሊገድብ ይችላል፣ ስለዚህ ዝርዝር እና ትክክለኛ መረጃ ማቅረብዎን ያረጋግጡ

source: Show More
am: ተጨማሪ አሳይ

source: Professional Details
am: የሙያ ዝርዝሮች

source: Additional Information
am: ተጨማሪ መረጃ

source: Nationality
am: ትውልድ

source: Country
am: ሀገር

source: City
am: ከተማ

source: Marriage Type
am: የጋብቻ ዓይነት

source: Marital Status
am: የጋብቻ ሁኔታ

source: Age
am: ዕድሜ

source: Children
am: ልጆች

# height
source: Height (cm)
am: መርበብ (ሴ.ሞ)

# weight
source: Weight (kg)
am: ቁስል (ኪ.ግ)

source: Skin Color
am: የቆዳ ቀለም

source: Body Shape
am: የሰውነት ቅርጽ

source: Job
am: ሥራ

source: Educational Qualification
am: የትምህርት ደረጃ

source: Financial Status
am: የፋይናንስ ሁኔታ

source: Monthly Income
am: ወርሃዊ ገቢ

source: Health Case
am: የጤና ሁኔታ

source: Religious Commitment
am: የሃይማኖት ቁርጠኝነት

source: Veil
am: ቃልማይ

source: Beard
am: ድምብ

source: Save
am: አስቀምጥ

# noNearbyUsers
source: No nearby users found
am: በአቅራቢያ ያሉ ተጠቃሚዎች አልተገኙም

source: Try Again
am: እንደገና ሞክር

# goToHome
source: Back to Login
am: ወደ መነሻ ተመለስ

source: Like
am: ወደድኩት

source: Ignore
am: አስወግድ

source: Other Options
am: ሌሎች አማራጮች

source: Notifications
am: ማሳወቂያዎች

source: Clear All
am: ሁሉንም አጽዳ

source: Error loading notifications
am: ማሳወቂያዎችን በመጫን ላይ ስህተት

# findPartner
source: Find your partner with us
am: የህይወት ጓደኛዎን ከእኛ ጋር ያግኙ

# marriageRelationship
source: Marriage is a great relationship
am: ጋብቻ ታላቅ ግንኙነት ነው

# perfectLifePartner
source: Find your perfect life partner
am: ፍጹም የህይወት ጓደኛዎን ያግኙ

# discoverSoulmate
source: Discover your soulmate with ease and confidence
am: የልብ ጓደኛዎን በቀላሉና በözደንነት ያግኙ

# foundationOfLove
source: The foundation of love, trust, and lifelong companionship
am: የፍቅር፣ የእምነት እና የዘላለም አጋርነት መሰረት

# guidedByFaith
source: Guided by faith, united for a lifetime in blessings
am: በእምነት የሚመራ፣ በበረከት ለዘላለም አብሮ

source: Next
am: ቀጣይ

source: Get Started
am: ጀምር

# termsAndConditionsApp
source: The terms and conditions of the App
am: የአፕ የዋጋና የአገልግሎት መረጃ

# iAmFemale
source: I'm Female
am: እኔ ሴት ነኝ

# continue_action
source: Continue
am: ቀጥል

source: Features
am: ባህሪያት

source: Receive message.
am: መልእክት ተቀበል።

# sendMessageToAny
source: Send message to any member.
am: ለማንኛውም አባል መልእክት ይላኩ።

# sendMessageToCountry
source: Send message to member from your country.
am: ከአገርዎ ላለ አባል መልእክት ይላኩ።

# messageWhoFavorited
source: Message who added you to his favorite list.
am: ወደ ተወዳጆች ዝርዝር ላከተተዎት መልእክት ይላኩ።

source: Reply to message.
am: መልእክት መመለስ።

# controlMessaging
source: Control who can message you.
am: ማን መልእክት መላክ እንደሚችል ይቆጣጠሩ።

source: Remove ads.
am: ማስታወቂያዎችን ያስወግዱ።

# premiumDescription
source: By subscribing to the premium package, you will activate all the available features and thus increase your efficiency in the application to reach your goal faster.
am: የፕሪሚየም ፓኬጅን በመመዝገብ፣ ሁሉንም ያሉትን ባህሪያት በማንቃት በመተግበሪያው ውስጥ ያለዎትን ውጤታማነት ይጨምራሉ እና ግብዎን በፍጥነት ለማሳካት ይችላሉ።

source: Subscribe Now
am: አሁን ይመዝገቡ

source: Edit Profile
am: መገለጫ አስተካክል

source: View Profile
am: መገለጫ ተመልከት

source: Share Profile
am: መገለጫ አጋራ

source: Report Profile
am: መገለጫ ሪፖርት አድርግ

source: Block Profile
am: መገለጫ አግድ

source: Unblock Profile
am: መገለጫ ማገድ አንሳ

source: Personal Information
am: የግል መረጃ

source: Contact Information
am: የመገናኛ መረጃ

source: Location Information
am: የአካባቢ መረጃ

source: Preference Information
am: የምርጫ መረጃ

source: Last Active
am: የመጨረሻ እንቅስቃሴ

source: Member Since
am: አባል ከሆነ ጀምሮ

source: Profile Views
am: የመገለጫ ጉብኝቶች

source: Profile Likes
am: የመገለጫ ወደድኩት

source: About Me
am: ስለ እኔ

source: Looking For
am: እየፈለግኩ ያለሁት

source: Interests
am: ፍላጎቶች

source: Hobbies
am: ሆቢዎች

source: Upload Photo
am: ፎቶ ስቀል

source: Remove Photo
am: ፎቶ አስወግድ

source: Make Profile Photo
am: የመገለጫ ፎቶ አድርግ

source: Required
am: አስፈላጊ

source: Optional
am: አማራጭ

source: Not Specified
am: አልተገለጸም

# searchScreenTitle
source: Search
am: በአማርኛ ፈልግ

source: Advanced Search
am: አዘምን ፈልግ

source: Quick Search
am: ቀላል ፈልግ

source: Search by Username
am: በተጠቃሚ ስም ፈልግ

source: Account information
am: መረጃ ስለ መለያ

# verify_email
source: Verify your email
am: ኢሜልዎን ያረጋግጡ

source: Your ID
am: መታወቂያዎ

source: Using Qismati
am: ቪስማቲን እንደተጠቀሙ

# usage_duration
source: 3 months
am: 3 ወራት

source: Your connect status
am: የእርስዎ እባብ ሁኔታ

# connect_status
source: Connected
am: ያገኙት

# control_messages
source: You can control who sends you messages
am: እርስዎ ማን ልክ መልእክቶች እንደሚላኩኝ በመቆጣጠር መታወቂያዎን ማንበብ ትችላላችሁ

source: Settings Page
am: ስተት ገፅ

# see_all_features
source: To see all features assigned to you in the app
am: በመታወቂያዎ ላይ ሁሉንም ባለመንበት ተቀባበል

source: Click here
am: እዚህ ጠቅላ

source: My Settings
am: ስለ መተግበሪያዎ

source: Language
am: ቋንቋ

source: Who can message you?
am: ማን ሊልክ ሊሰጠኝ?

source: Countries
am: ሀገሮች

source: Notification Settings
am: ማሳሰቢያ ስርዓት

# who_added_to_favorite
source: Who added me to their favorite list?
am: ማን እንደ ተወዳጅ ዝርዝሩን ጨምሮአል?

source: My Profile Visits
am: በግል ፎቶ ቦታዬ ጉብኝቶች

# who_added_to_ignore
source: Who added me to the ignore list?
am: ማን በምንም ሁኔታ እንደ እንደ ማስተዋል ይጨምሮአል?

source: New Messages
am: አዳዲስ መልእክቶች

# who_allowed_see_photos
source: Who allowed me to see their photos?
am: ማን ሰማይ ፎቶ ስለተጠቀምት?

source: Success Stories
am: ስኬት ታሪኮች

source: Ringtone Alert
am: የምስጢሩ አሳሳቢ

source: Vibrate Alert
am: ተንቀሳቃሽ ማሳሰቢ

# notify_when_app_off
source: Notify me when the app is off
am: እባኮት ለተለያዩ ሰነት

# receive_email_notifications
source: Receive notification on e-mail
am: ማስታወቂያ በኢሜል እንዲታወቅ

source: Font Settings
am: የፊደል ስርዓት

source: Increase font-size
am: ፊደልን አበርክስ

source: Signup successful
am: የመዝግብ ሂደት ተሳክቷል

source: Sign up
am: መዝግብ

source: App Terms
am: የመተግበሪያ ውሎች

# terms_conditions_text
source: By clicking on sign up button, you agree to
am: የመዝግብ እቅፍ ይጫኑ እና ተስማምተዋል

# terms_conditions
source: Terms and Conditions
am: ውሎች እና አቀራረብ

source: Unimplemented state
am: የተፈጠረ ሁኔታ

source: Signed up user successfully
am: ተመዝግበ ተጠቃሚ በተሳካ ሁኔታ

source: Could not signup user
am: ተጠቃሚ መዝግብ አልቻልኩም

source: Create Account
am: መዝግብ ይፍጠሩ

# create_account_description
source: Create an account so you can explore all App
am: አካውንት ይፍጠሩ ወይም እንደገና ይመልከቱ ሁሉ የአፕ

source: About Your Partner
am: ስለ እንግዳው

# about_your_partner_info
source: To provide an accurate answer, please do not enter an email or phone number.
am: እባኮትን እውነተኛ ምላሽ ለማቅረብ ኢሜይል ወይም ስልክ ቁጥር አትገቡ።

source: Education and Work
am: ትምህርት እና ሥራ

# education_qualification
source: Educational Qualification
am: ትምህርት አማራጭ

source: Financial Status
am: የገንዘብ ሁኔታ

source: Job Category
am: የሥራ ምድብ

source: Monthly Income
am: ወርሃዊ ገቢ

# health_case
source: Health Status
am: የጤና ሁኔታ

# your_look
source: Your Appearance
am: የእርስዎ ዝርዝር

source: Skin Color
am: የቆዳ ቀለም

source: Body Shape
am: የአካል ቅርጸት

source: Marital Status
am: የጋብቻ ሁኔታ

source: Status
am: ሁኔታ

# marriage_type
source: Type of Marriage
am: የጋብቻ ዓይነት

source: Religion
am: ሃይማኖት

# religion_commitment
source: Religious Commitment
am: የሃይማኖት ተመልክቶ

source: Prayer
am: በጸሎት

source: Smoking
am: ጨው መጠቀም

source: Talk About Yourself
am: ስለ እርስዎ ንገሩ

# talk_about_yourself_info
source: This information will only be used to respond to you and will not be publicly shared.
am: ይህ መረጃ በዚህ ላይ ብቻ ይጠቀማል፣ በግል ይታወቃል።

# username_info
source: The username must contain 15 characters and not exceed this limit.
am: የተጠቃሚ ስም 15 አንድ ይወስዳል እና ይህ ወደ ታች አይሄይ።

source: Gender
am: ጾታ

source: Full Name
am: አንደኛ ስም

source: Phone Number
am: የስልክ ቁጥር

source: Confirm Password
am: የይለፍ ቃልን ይረጋግጡ

# password_info
source: The password must contain at least 6 characters.
am: የይለፍ ቃል በአንድ ይህ ግድ ይወዳዳል።

# account_exist
source: Do you have an account?
am: እንዴት ይቀበሉ?

source: Login
am: ይግቡ

source: Confirm
am: ይረጋገጡ

# code_sent
source: The code has been sent to your email.
am: ኮድ ወደ ኢሜልዎ ተላከ።

source: Enter Code
am: ኮድ ይገቡ

source: Sporty
am: ስፖርታዊ

source: Slim
am: የገዛ እና

source: Medium
am: መካከለኛ

source: Overweight
am: በዋንይ ውስጥ

source: Bulky
am: አስተማሪ

source: Built
am: ተገንብቷል

source: White
am: ነጭ

source: Wheatish
am: ዳቦ

source: Whitish
am: ነጭ አቅርቦት

source: Light Brown
am: ቡናዊ ቀለም

# to_brown
source: Dark Brown
am: ጨለማ

source: Moderate Brown
am: መካከለኛ ቡና

source: Dark Brown
am: ጨለማ ቡና

source: Dark
am: ጨለማ

source: Prays punctually
am: በጊዜው ይጸልያል

source: Prays most of the time
am: ወደ አብዛኛው ጊዜ ይጸልያል

# prays_usually
source: Usually prays
am: በአብዛኛው ጊዜ ይጸልያል

source: I do not pray
am: አልጸልየም

source: Prefer not to say
am: እባኮትን አይነቀፍ።

source: Not religious
am: የሃይማኖት የለም

# little_religious
source: A little religious
am: ትንሽ የሃይማኖት ነኝ

source: Religious
am: የሃይማኖት ነኝ

source: Very religious
am: በጣም የሃይማኖት ነኝ

source: Unemployed
am: የሥራ ውስጥ ያለው

source: Less than 200 dollars
am: 200 ዶላር አንድ ወይም ከዚያ በታች

source: Between 200 and 500 dollars
am: 200 እና 500 ዶላር መካከል

source: Between 500 and 800 dollars
am: 500 እና 800 ዶላር መካከል

source: Between 800 and 1200 dollars
am: 800 እና 1200 ዶላር መካከል

source: Between 1200 and 1800 dollars
am: 1200 እና 1800 ዶላር መካከል

source: Between 1800 and 2500 dollars
am: 1800 እና 2500 ዶላር መካከል

source: Between 2500 and 3500 dollars
am: 2500 እና 3500 ዶላር መካከል

source: Between 3500 and 5000 dollars
am: 3500 እና 5000 ዶላር መካከል

source: Between 5000 and 7000 dollars
am: 5000 እና 7000 ዶላር መካከል

source: Between 7000 and 10000 dollars
am: 7000 እና 10000 ዶላር መካከል

source: Between 10000 and 13000 dollars
am: 10000 እና 13000 ዶላር መካከል

source: Between 13000 and 15000 dollars
am: 13000 እና 15000 ዶላር መካከል

source: More than 15000 dollars
am: 15000 ዶላር በላይ

source: Healthy
am: ጤናማ

source: Motor Disability
am: የእጅ እና እግር አንድነት

source: Amputation
am: የቀለበይ

source: Bending Disability
am: የቀይር አድርገ

source: Hearing Disability
am: የስሜት እና ድምፅ ይሁኔታ

source: Visual Disability
am: የእንደ እንቅልፍ

source: Leprosy
am: የጽዳብ

source: Skin Diseases
am: የቆዳ አይነት

source: Distorted Burns
am: የማሳያ እና በር

source: Diabetes
am: ዳይበቲስ

source: Impaired Hearing
am: የስሜት ወደ አይታወቅ

source: Speech Impairment
am: የንባብ አንደኛ

source: Excessive Obesity
am: አብዛኞቹ ስፍራ

source: Infantile Paralysis
am: የሕፃን ዕቅፍ

source: Quadriplegia
am: እንደ ድምፅ ወይም ይሁኔታ

source: Hemiplegia
am: በስም በጀምር

source: Impotence
am: የነፍስ ወይም ይሁኔታ

source: Sterility
am: የውይይት

source: Loss of a Limb
am: አንድ ክፍል ወይም ይሁኔታ

source: Pygmy
am: ሂወር

source: Down's Syndrome
am: የዳውንስ ስንድም

source: Psychiatric Disability
am: የአእምሮ አይነት

source: Middle School/Junior High
am: የመካከለኛ ዳሰሳ/የመንግስቱ

source: High School
am: የከፍተኛ ቤተማ

source: Graduate/Postgraduate
am: የገለም/የዝርዝር

source: Doctorate
am: ዶክታር

source: Self-Taught
am: በራስ ይሚስማር

source: Administration
am: አስተዳደር

source: Another Thing
am: ሌላ ነገር

# art_literary
source: Art / Literature
am: አርት / ምርጥ

source: Computer / Informatics
am: ኮምፑተር / መረጃ

source: Construction
am: መምስለ

source: Food Services
am: የምግብ አገልግሎት

source: I am still a student
am: እኔ እስካለው ተማሪ ነኝ

source: Law
am: ሕግ

source: Medical Field
am: የህክምና መርሀ

source: Politics / Government
am: ፖለቲካ / መንግስት

source: Private
am: ግል

source: Retired
am: የተወው

source: Sales and Marketing
am: ሽያጭ እና ገቢ

source: Secretarial
am: የፕላክ

source: Teaching
am: የአስተማሪ

source: Technical / Science / Engineering
am: ቴክኒክ / ሳይንስ / ሂደት

source: Trade
am: ንግድ

source: Transport
am: የዋንድዌት

source: Without Employment
am: በሥራ ውስጥ የለም

source: Self-Sufficient
am: ራስ በራስ ይኖራል

source: Moderate
am: መካከለኛ

source: Saving
am: መዝናን

source: Spending
am: ይጊዝ

source: Single
am: ብዙ

source: Divorced
am: የተፈቀደ

source: Widowed
am: የሞት ብዙ

source: Only one wife
am: አንድ ወይት ብቻ

# accept_polygamy
source: Accepts Polygamy
am: የተወላጅነት እንደምታወቅ

source: Male
am: ወንድ

source: Female
am: ሴት

source: Other
am: ሌላ

source: Register
am: መዝግብ

# assalamuAlaikum
source: Assalamu alaikum wa rahmatullahi
am: ሰላም ላይክም ወራሕማትሉልላ

# freeOfCharge
source: To allow all member the opportunity to register for Qismiati, it is free of charge.
am: ለአባላት ሁሉ የተመዘገቡ የተመዘገቡ ለተመዘገበ ነፃ ነው።

# takeOath
source: Please take an oath before registering
am: እባክዎን ከመዝግብ በፊት ወረዳት ይውሰዱ

# oathText
source: I swear by ALLAH Almighty that I will not enter this App except for the purpose of legal marriage, and not for any other purpose. I promise ALLAH and I promise you that I will not waste the hard work of the App, and that I will not deceive the members, and that I will be honest with ALLAH and then with myself, and that I will abide by.
am: እኔ በአላህ አብይ እምነት ወይዘን እኔ ይህን መተግበር አልቻልኩም በሐሳቦች የማለው የምርጥ ጋብቻ በማድረግ ይህን አልቻልኩም።

# allahWitness
source: ALLAH is the best witness
am: አላህ የበለጠ ምስክር ነው

# takenOath
source: I've taken an oath
am: ወረዳውን አውርድዎት

# iAmMale
source: I'm Male
am: እኔ ወንድ ነኝ

source: Write a message...
am: መልክዕ ይጻፉ...

source: Notice
am: ማሳሰቢያ

# warning
source: Warning: to avoid any act of scam we ask you sincerely to not send money or respond to aid requests.
am: ማሳሰብ: ከእቃ ማዕቀብ መውረድ ይቀጥሉ በእቅፍ እባክዎን ገንዘብ አትላኩ ወይም እንደማህደር ምንም አይገኝም።

# report_offensive_message
source: To report an offensive message, tap and hold the message and select the Report the message option
am: አውድ መልክዕ ማቅረብ ለመግኘት መልክዕ ይጥፉ ወምድር ወሳነ ወሳነው ይምረጡ

# manage_privacy
source: You can manage your privacy and chat permissions through your account settings
am: እቅፍ ማስታወቂያ ወእንዴት ማስታወቂያ በመለያ በሁኔታዎች ይችላሉ

source: Accept
am: አስቀድሞ

source: as
am: እንደ
